Cinema/src/Reports/НекорректноЗаполненныеФильмы/НекорректноЗаполненныеФильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>НекорректноЗаполненныеФильмы</name>
</mdclass:Report>

Cinema/src/InformationRegisters/ЖанрыФильмов/ЖанрыФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖанрыФильмов</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Жанр</name>
    <type>
      <types>CatalogRef.Жанры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/InformationRegisters/СтраныПроизводители/СтраныПроизводители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтраныПроизводители</name>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/Reports/НекорректноЗаполненныеФильмы/ObjectModule.bsl
Функция ПодробныйВариант(Настройки)
	
	// Получение параметра пользовательских настроек
	ОбъемомНеМеньше	= 0;
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МеньшеЧем");
	Если ПараметрДанных <> Неопределено Тогда
		Для каждого ЭлементПользовательскойНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ЭлементПользовательскойНастройки.ИдентификаторПользовательскойНастройки = ПараметрДанных.ИдентификаторПользовательскойНастройки
				И ЭлементПользовательскойНастройки.Использование И ЭлементПользовательскойНастройки.Значение > 0
			Тогда
				ОбъемомНеМеньше	= ЭлементПользовательскойНастройки.Значение * 1024;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Получим данные, которыми нужно заполнить внешний набор данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Ссылка КАК Фильм,
		|	ВЫБОР
		|		КОГДА Фильмы.ОригинальноеНазвание = """"
		|			ТОГДА Фильмы.Наименование
		|		ИНАЧЕ Фильмы.Наименование + "" ("" + Фильмы.ОригинальноеНазвание + "")""
		|	КОНЕЦ КАК Наименование,
		|	Фильмы.ДатаВыхода КАК ДатаВыхода,
		|	Фильмы.Афиша КАК Афиша
		|ПОМЕСТИТЬ ВсеФильмы
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И НЕ Фильмы.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Аннотации.Владелец КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Аннотации.Ссылка) КАК Аннотация
		|ПОМЕСТИТЬ Аннотации
		|ИЗ
		|	Справочник.Аннотации КАК Аннотации
		|ГДЕ
		|	НЕ Аннотации.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Аннотации.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖанрыФильмов.Фильм КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЖанрыФильмов.Жанр) КАК Жанр
		|ПОМЕСТИТЬ Жанры
		|ИЗ
		|	РегистрСведений.ЖанрыФильмов КАК ЖанрыФильмов
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖанрыФильмов.Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраныПроизводители.Фильм КАК Фильм,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтраныПроизводители.Страна) КАК Страна
		|ПОМЕСТИТЬ Страны
		|ИЗ
		|	РегистрСведений.СтраныПроизводители КАК СтраныПроизводители
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраныПроизводители.Фильм
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеФильмы.Фильм КАК Фильм,
		|	ВсеФильмы.Наименование КАК Наименование,
		|	ВсеФильмы.ДатаВыхода КАК ДатаВыхода,
		|	ВсеФильмы.Афиша КАК Афиша,
		|	ВсеФильмы.НетАннотации КАК НетАннотации,
		|	ВсеФильмы.НеУказанЖанр КАК НеУказанЖанр,
		|	ВсеФильмы.НеУказанаСтрана КАК НеУказанаСтрана,
		|	ЛОЖЬ КАК НетИзображения,
		|	ВЫБОР
		|		КОГДА ВсеФильмы.НетАннотации
		|			ТОГДА ИСТИНА
		|		КОГДА ВсеФильмы.НеУказанЖанр
		|			ТОГДА ИСТИНА
		|		КОГДА ВсеФильмы.НеУказанаСтрана
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеполныеДанные,
		|	2 КАК ВариантОтчета
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВсеФильмы.Фильм КАК Фильм,
		|		ВсеФильмы.Наименование КАК Наименование,
		|		ВсеФильмы.ДатаВыхода КАК ДатаВыхода,
		|		ВсеФильмы.Афиша КАК Афиша,
		|		ВЫБОР
		|			КОГДА Аннотации.Аннотация ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК НетАннотации,
		|		ВЫБОР
		|			КОГДА Жанры.Жанр ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК НеУказанЖанр,
		|		ВЫБОР
		|			КОГДА Страны.Страна ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК НеУказанаСтрана
		|	ИЗ
		|		ВсеФильмы КАК ВсеФильмы
		|			ЛЕВОЕ СОЕДИНЕНИЕ Аннотации КАК Аннотации
		|			ПО ВсеФильмы.Фильм = Аннотации.Фильм
		|			ЛЕВОЕ СОЕДИНЕНИЕ Жанры КАК Жанры
		|			ПО ВсеФильмы.Фильм = Жанры.Фильм
		|			ЛЕВОЕ СОЕДИНЕНИЕ Страны КАК Страны
		|			ПО ВсеФильмы.Фильм = Страны.Фильм) КАК ВсеФильмы";
	
	Результат     = Запрос.Выполнить();
	НаборДанныхТЗ = Результат.Выгрузить();
	ТипКартинка   = Тип("Картинка");
	
	Для каждого СтрокаТЗ Из НаборДанныхТЗ Цикл
		ЗначениеВХранилище = СтрокаТЗ.Афиша.Получить();
		Если ТипЗнч(ЗначениеВХранилище) <> ТипКартинка Тогда
			СтрокаТЗ.НетИзображения = Истина;
			СтрокаТЗ.НеполныеДанные = Истина;
		Иначе
			ДвчДанные = ЗначениеВХранилище.ПолучитьДвоичныеДанные();
			Если ДвчДанные <> Неопределено Тогда
				РазмерДанных = ДвчДанные.Размер();
				Если ОбъемомНеМеньше > РазмерДанных Тогда
					СтрокаТЗ.НетИзображения = Истина;
					СтрокаТЗ.НеполныеДанные = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборДанныхТЗ = НаборДанныхТЗ.Скопировать(НаборДанныхТЗ.НайтиСтроки(Новый Структура("НеполныеДанные", Истина)));
	
	Возврат НаборДанныхТЗ;
	
КонецФункции

Функция КраткийВариант()
	
	НаборДанныхТЗ = Новый ТаблицаЗначений;
	НаборДанныхТЗ.Колонки.Добавить("Фильм", Новый ОписаниеТипов("СправочникСсылка.Фильмы"));
	НаборДанныхТЗ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));
	НаборДанныхТЗ.Колонки.Добавить("ДатаВыхода", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	НаборДанныхТЗ.Колонки.Добавить("НетАннотации", Новый ОписаниеТипов("Булево"));
	НаборДанныхТЗ.Колонки.Добавить("НеУказанЖанр", Новый ОписаниеТипов("Булево"));
	НаборДанныхТЗ.Колонки.Добавить("НеУказанаСтрана", Новый ОписаниеТипов("Булево"));
	НаборДанныхТЗ.Колонки.Добавить("НетИзображения", Новый ОписаниеТипов("Булево"));
	НаборДанныхТЗ.Колонки.Добавить("ВариантОтчета", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Любой)));
	
	Возврат НаборДанныхТЗ;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДопСвойства = Настройки.ДополнительныеСвойства;
	КлючТекВарианта = "";
	Если ДопСвойства.Свойство("КлючТекущегоВарианта", КлючТекВарианта) Тогда
		Если КлючТекВарианта = "ПодробныйВариант" Тогда
			НаборДанныхТЗ = ПодробныйВариант(Настройки);
		Иначе
			НаборДанныхТЗ = КраткийВариант();
		КонецЕсли;
	Иначе
		НаборДанныхТЗ = КраткийВариант();
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Формируем макет с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	// Передаём в макет компоновки схему, настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Выполняем компоновку с помощью процессора компоновки. Для этого выполняем метод процессора компоновки данных Инициализировать().
	// В качестве параметров передаём макет компоновки данных, внешние наборы данных (тип: Структура, ключ структуры должен совпадать с
	// именем объекта в схеме компоновки данных, значение - сформированная таблица значений), данные расшифровки.
	ВнешнийНаборДанных = Новый Структура("НекорректноЗаполненные", НаборДанныхТЗ);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	// Выводим результат в табличный документ.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Заполним флажки-изображения в табличном документе
	Для СчетчикСтрок = 1 По ДокументРезультат.ВысотаТаблицы Цикл
		Для СчетчикКолонок = 1 По ДокументРезультат.ШиринаТаблицы Цикл
			ОбластьЯчеек = ДокументРезультат.Область(СчетчикСтрок, СчетчикКолонок, СчетчикСтрок, СчетчикКолонок);
			ТекстЯчейки  = ВРег(ОбластьЯчеек.Текст);
			Если ТекстЯчейки = "@ИСТИНА@" ИЛИ ТекстЯчейки = "@ЛОЖЬ@" Тогда
				НовыйРисунок = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				НовыйРисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				НовыйРисунок.ЦветЛинии = Новый Цвет(230, 230, 230);
				НовыйРисунок.Расположить(ОбластьЯчеек);
				Если ТекстЯчейки = "@ЛОЖЬ@" Тогда
					НовыйРисунок.Картинка = БиблиотекаКартинок.СинтаксическийКонтроль;
				Иначе
					НовыйРисунок.Картинка = БиблиотекаКартинок.Остановить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
